//个位数为6且能被3整除的四位数共有______个，五位数共有______个。
//五位数有：3000四位数有：300
#include <stdio.h>

int main() {
    int a = 0;  // 用于统计满足条件的五位数个数
    int b = 0;  // 用于统计满足条件的四位数个数



    // 遍历所有四位数，范围是1000到9999
    for (int j = 1000; j < 10000; j++) {
        if ((j % 10 == 6) && (j % 3 == 0)) {
            b++;
        }
    }
    printf("个位数为6且能被3整除的四位数有：%d个\n", b);
    // 遍历所有五位数，范围是10000到99999
    for (int i = 10000; i < 100000; i++) {
        if ((i % 10 == 6) && (i % 3 == 0)) {  // 使用&&表示要同时满足两个条件
            a++;
        }
    }
    printf("个位数为6且能被3整除的五位数有：%d个\n", a);
    return 0;
}
